{
  "main": {
    "name": "Jahaira Marrero",
    "occupation": "Data Engineer",
    "description": "",
    "image": "profilepic.jpg",
    "bio": "I'm passionate about creating innovative solutions and have with experience building full stack applications with Ruby, Rails, JavaScript, React, SQL databases, and RESTful API architecture. Emerging from a career in Education, I traded the classroom and school leadership for coding when working with software engineers to improve software usability and create better communication lines to families. Fully immersed in coding, I am excited to own  the technical planning, implementation and delivering impactful features as a developer.",
    "contactmessage": "Contact me using the form below or email me directly.",
    "email": "jahaira@jahairamarrero.com",
    "phone": "347-561-8717",
    "address": {
      "street": "(Your Street)",
      "city": "New York",
      "state": "NY",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "http://timbakerdev.com",
    "social": [
      {
        "name": "twitter",
        "url": "https://twitter.com/marrero_jahaira",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/jahaira-marrero/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/jahaira.marrero.dev/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/jahaira-marrero",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "These are the languages I have experience working with.",
    "education": [
      {
        "school": "Flatiron School",
        "degree": "Software Engineer Certificate",
        "graduated": "April 2021",
        "description": "Software Engineering Immersive Program designed to equip students with the skills necessary to launch careers in tech. This program includes three months of intensive, full-time on-campus training (classes/lectures, individual, pair and group programming projects, code challenges, presentations and more). The curriculum encompasses a variety of languages, frameworks, and libraries in-depth, including Ruby, Rails, SQL, PostgreSQL, JavaScript, React, Redux, Git, HTML, and CSS."
      },
      {
        "school": "Long Island University",
        "degree": "Master Secondary Science Education",
        "graduated": "September 2012",
        "description": "Completed an inclusive education program in secondary biology education grounded in the belief to view all students, families and communities as integral to the educational process and teach diverse adolescent learners through the integration of coursework and fieldwork."
      },
      {
        "school": "Stony Brook University",
        "degree": "Bachelor of Science in Health Sciences",
        "graduated": "May 2005",
        "description": "Completed the multidisciplinary program that fostered research, scholarly activity, critical thinking, evidence-based practice, leadership, and professionalism, while affirming the importance of ethical behavior, human diversity, service, and a team approach to health care industry."
      }
    ],
    "work": [
      {"company": "Capgemini",
        "title": "Data Engineer",
        "years": "July 2021 - Present"
      },
      {"company": "Flatiron School",
        "title": "Student Software Engineer",
        "years": "January 2021 - April 2021",
        "description": "Completed over 1000+ hours of intensive training through lectures, individual, pair and group programming projects, code challenges and presentations. Acquired and applied full stack skills in Ruby,mJavascript (ES6), Rails, React, HTML and CSS."
      },
      {
        "company": "Etoile Academy Charter School",
        "title": "Dean of Students",
        "years": "July 2019 - June 2021",
        "description": "Collaborated with the School Leaders to create a school culture scope and sequence that utilizes advisory to model, taught, and rewarded students for character development. Facilitated school culture professional development for all staff including practice and feedback sessions on the school’s discipline system. Observed classes and teachers to give feedback on classroom culture and the implementation of the schoolwide discipline system. Conducted weekly coaching to include goal setting with staff around improving school culture. Provided clear, consistent consequences to mid-level and high-level student behaviors. Responded directly to high-level student behaviors and supported teachers in responding to low-level behaviors. Established and communicated clear objectives for all learning activities. Identified and selected different instructional resources and methods to meet students' varying needs."
      },
      {
        "company": "KIPP Peace Elementary",
        "title": "Math Teacher, Grade Level Chair",
        "years": "February 2018 - June 2019",
        "description": "Designed lesson plans and presentations for Math classes designed to remediate and accelerate curriculum for elementary students. education, special education, and Honors students Keep updated with developments in the subject area, teaching resources and methods, and make relevant changes to instructional plans and activities. Maintain discipline in accordance with the rules and disciplinary systems of the school."
      },
      {
        "company": "New York City Department of Education",
        "title": "Biology, Forensic Science Teacher, Grade Level Chair",
        "years": "September 2012 - June 2017",
        "description": "Delivered Biology instruction while regulating excellent classroom management skills to maximize student learning. Integrated multiple teaching styles to intensify the range of learning, while redesigning a curriculum aligned with the New York City Biology scope and sequence. Implemented curriculum utilizing project-based education and alternative assessments, integrated a Scientific Literacy Curriculum aligned to the Common Core Standards."
      },
      {
        "company": "Otterbourg Steindler Houston & Rosen, P.C.",
        "title": "Administrative Assistant",
        "years": "March 2008 - January 2012",
        "description": "Served as the first point of contact for guests, answered phones, and maintained files. Developed, implemented, directed, and managed projects and administrative operations; established priorities and meeting deadlines for a full range of activities to include short and long-range planning, budget forecasting tracking, and reporting."
      },
      {
        "company": "Weill Cornell Medical College",
        "title": "Curriculum Coordinator",
        "years": "August 2006 - March 2008",
        "description": "Integrated cross coverage for the faculty with the delivery of lectures, small groups, labs and coordinated specific needs accordingly. Spear headed accurate student grades by compiling scored exams and standardizing, modified test scoring through quantitative reports. Prioritized the completion of student evaluations by faculty for score reports."
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "90%"
      },
      {
        "name": "SQL",
        "level": "90%"
      },
      {
        "name": "Spark SQL",
        "level": "90%"
      },
      {
        "name": "Pyspark",
        "level": "90%"
      },
      {
        "name": "Ruby",
        "level": "90%"
      },
      {
        "name": "Ruby on Rails",
        "level": "80%"
      },
      {
        "name": "JavaScript (ES6)",
        "level": "90%"
      },
      {
        "name": "ReactJS",
        "level": "90%"
      },
      {
        "name": "CSS",
        "level": "50%"
      },
      {
        "name": "HTML",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Dismissal Made Easy",
        "category": "Website I built to make inputting dismissal changes for schools easier for admins and teachers.",
        "image": "Dismissal-Made-Easy.png",
        "url": "https://drive.google.com/file/d/1h033KVQ-9VgP_6ymuPBNs7tTyGx1c-hw/view?usp=sharing"
      },
      {
        "title": "My Watch List",
        "category": "Website I built that allows you to search for a movie by name and add to the appropriate streaming service you are subscribed to.",
        "image": "My-Watch-List.png",
        "url": "https://drive.google.com/file/d/1bF2vR_xWq04fTBJ-s-i9d8TfeFL3JnjH/view?usp=sharing"
      },
      {
        "title": "Retake University",
        "category": "Website I built that allows you to enroll in courses at the school.",
        "image": "Retake-University.png",
        "url": "https://drive.google.com/file/d/18UMNW__W8VIYYzz0jll55ZOEnpIzjLb3/view?usp=sharing"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
